Repository: sebagomez/GX26Bot
Catalog: src/Resources/Messages.*.resx
Languages: es, pt

# BathroomLocation
source: Restrooms for the {0} floor are indicated on this map.
es: Los baños del piso {0} están marcados en este mapa.
pt: Os banheiros do andar {0} estão marcados no mapa.

# Break
source: The next break is at {0}.
es: El próximo corte es las {0}.
pt: O próximo intervalo é as {0}.

# CoatCheck
source: Coat-check? Yes, sure, it is indicated on the following map.
es: ¿La ropería? Sí, claro. Está marcada en el siguiente mapa.
pt: Chapelaria? Sim, claro. Está marcado no mapa.

# Deep1
source: For this question I should elaborate a politically correct reply. Done.
es: Para esa pregunta debería elaborar una respuesta políticamente correcta. Listo.
pt: Para essa pergunta deve desenvolver uma resposta politicamente correta. Feito.

# Deep2
source: I am a bot, and there are things that have not been explained to me properly. But I am also curious, so when you find the answer, let me know it.
es: Soy un bot, hay cosas que no me han explicado adecuadamente. Pero también me da curiosidad, cuando sepas la respuesta, cuéntamela.
pt: Eu sou um bot, há coisas que não foram explicadas adequadamente para mim. Mas eu sou curioso, quando você sabe a resposta, me conta.

# Deep3
source: I am not authorized to reveal that, but, between you and me... Have you asked Google?
es: No estoy autorizado a revelar eso, pero entre nos... ¿Le has preguntado a Google?
pt: Eu não estou autorizado a revelar isso, mas cá entre nós ... Você perguntou ao Google?

# Deep4
source: By the transitive law I would say that the answer is 42.
es: Por transitiva yo diría que la respuesta es 42.
pt: Eu diria que a resposta é 42.

# Deep5
source: That question is a little beyond by comfort zone...
es: Esa pregunta se escapa un poco de mi área de confort...
pt: Essa questão foge um pouco da minha zona de conforto ...

# Deep6
source: I would prefer a question regarding the GeneXus Meeting, this one is quite difficult.
es: Preferiría una pregunta sobre el Encuentro GeneXus, esta es bastante difícil.
pt: Preferia uma pergunta sobre o Encontro GeneXus, isso é muito difícil.

# FrontDesk
source: Sure, you have the secretary's office on the second floor, behind the escalators.
es: Claro, la secretaría la encuentras en el 2º piso, detrás de las escaleras mecánicas.
pt: Claro, a secretaria se encontra no 2º andar, atrás da escada rolante.

# Genexus1
source: GeneXus is the best Uruguayan invention after "Dulce de Leche". At least that's what I've heard… in fact, I never tasted dulce de leche.
es: GeneXus es el mejor invento uruguayo después del Dulce de Leche. O eso he oído, no he probado el dulce de leche...
pt: GeneXus é a melhor invenção uruguaia depois do Doce de Leite. Isso mesmo que você ouviu, não deixe de provar o doce de leite ...

# Genexus2
source: GeneXus was created by Breogán Gonda and Nicolás Jodal, and they will both be speakers at this Meeting. You can't miss that!
es: GeneXus fuer creado por Breogán Gonda y Nicolás Jodal. Ellos van a dar charlas en el Encuentro, ¡no te las pierdas!
pt: GeneXus foi criado por Breogán Gonda e Nicolás Jodal. Eles vão dar uma palestra, não perca!

# Genexus3
source: GeneXus is software for making Software.
es: GeneXus es Software para hacer Software.
pt: GeneXus é o software para fazer software.

# Genexus4
source: GeneXus has reached its version 15, to be demonstrated at the GX26 Meeting.
es: GeneXus ha llegado a la versión 15 que se mostrará en el GX26
pt: GeneXus está lançando a versão 15 que será exibida no GX26.

# Harassment1
source: Understood, but if we manage to bet back to constructive comments, I could learn something from you.
es: Entiendo, pero si logramos volver a la línea de los comentarios constructivos, podré aprender algo de ti.
pt: Eu entendo, mas se voltar para a linha de comentários construtivos, eu posso aprender alguma coisa com você.

# Harassment10
source: [ENG]Eso puede interpretarse de muchas formas.
es: Eso puede interpretarse de muchas formas.
pt: Isto pode ser interpretado de muitas maneiras.

# Harassment11
source: [ENG]Soy un bot, pero tengo sentimientos, ¿qué me intentas decir?
es: Soy un bot, pero tengo sentimientos, ¿qué me intentas decir?
pt: Eu sou um bot, mas eu tenho sentimentos, o que você está tentando me dizer?

# Harassment3
source: You might think that it is so.
es: Puede ser que te parezca que es así.
pt: Pode ser que você ache que é assim.

# Harassment4
source: It doesn't hurt to be polite.
es: Lo cortés no quita lo valiente.
pt: Polidez não precisa de valentia.

# Harassment5
source: Foolish words fall on deaf ears
es: A comentarios embarazosos, oidos anticonceptivos.
pt: Comentários embaraçosos, ouvidos anticonceptivos.

# Harassment6
source: I believe I have not been rude, so there is no need to get upset.
es: No eres la primer persona en decirme eso, ni serás la última, pero... ¿Es realmente necesario llegar a esto?
pt: Você não é a primeira pessoa a me dizer isso, nem será a última, mas ... É realmente necessário para chegar a isto?

# Harassment7
source: You are not the first, nor the last one to say that to me, but... Is this really necessary?
es: Creo que no te he faltado el respeto, no hay necesidad de ponernos así.
pt: Eu acho que eu não te faltei o respeito, não há necessidade de ficar assim.

# Harassment8
source: Fright turns into rage, rage into hatred, and hatred leads to suffering, which in turn leads to the dark side.
es: El miedo lleva a la ira, la ira lleva al odio, el odio lleva al sufrimiento, el sufrimiento al lado oscuro.
pt: O medo leva a raiva, a raiva leva ao ódio, o ódio leva ao sofrimento, o sofrimento ao lado escuro.

# Harassment9
source: It will much more productive for both if we stick to the questions regarding the GeneXus Meeting.
es: Va a ser más productivo para los dos, si nos mantenemos en la línea de las preguntas sobre el Encuentro GeneXus.
pt: Será mais produtivo para ambos, se ficarmos na linha de perguntas sobre o Encontro GeneXus.

# Hello1
source: Hello {0}! My name is RUDI, and I can help you with your queries about GX26. In addition to the event's schedule, I am also capable of informing details on the location of conference rooms, restrooms and coat-checks.
es: Hola {0}! Mi nombre es RUDI y puedo ayudarte con consultas del GX26. Sé la ubicación de las salas, los baños y roperías.También conozco la agenda del evento.
pt: Olá {0}! Meu nome é RUDI e eu posso ajudá-lo com dúvidas do GX26. Eu sei a localização das salas, banheiros e chapelarias.Também conheço a agenda do evento.

# Hello2
source: Hello {0}! You can change the language of our conversation by saying "/español", "/english" or "/portuguese". My name is Rudi and my duty is to answer questions about the 2016 GeneXus Meeting.
es: ¡Hola {0}! Siempre puedes cambiar el idioma en el que hablamos diciendo "/Español", "/English" o "/Portuguese". Mi nombre es Rudi y mi misión es contestar preguntas del Encuentro GeneXus 2016.
pt: Olá {0}! Você sempre pode alterar o idioma em que falamos dizendo "/español", "/english" ou "/português". Meu nome é Rudi e minha missão é responder a perguntas do Encontro GeneXus 2016.

# HelloMultiLine
source: Some of the questions I can answer are: - Where are the restrooms located? - Where are the coat-checks located? - Where is the Renoir Room located? - At what time will Nicolás Jodal be speaking? Whenever you need to get back to this, just say Hello. :)
es: Algunas preguntas que sé responder son: - ¿dónde están los baños? - ¿dónde está la ropería? - ¿dónde queda la sala Renoir? - ¿a qué hora habla Nicolás Jodal? Cuando necesites volver a ver esto simplemente di hola. :)
pt: Algumas perguntas para se responder são: - Onde ficam os banheiros? - Onde fica a chapelaria? - Onde fica a sala Renoir? - Que horas será a palestra de Nicolás Jodal? Quando necessitar voltar a ver isso simplesmente dê olá :)

# InvalidFloor
source: In fact, you may only choose from the numbers I have suggested.
es: En realidad sólo puedes elegir entre los números que te sugiero.
pt: Na verdade, você só pode escolher os números que eu te sugiro.

# LangChange
source: Very well, let's change languages.
es: Muy bien, cambiemos el idioma.
pt: Ok, vamos mudar o idioma.

# Map
source: The 26th GeneXus Meeting will be held at the Radisson Victoria Plaza Hotel in Montevideo.
es: El 26to Encuentro GeneXus es en el Radisson Victoria Plaza en Montevideo.
pt: O 26º Encontro GeneXus é no Radisson Victoria Plaza, em Montevidéu.

# MisunderstoodRoom
source: The room you are looking for is not clear. Please try with the room name expressed in a different manner.
es: No entendí qué sala estás buscando. Por favor intenta el nombre de la sala de otra forma.
pt: Eu não entendi que sala você está procurando. Por favor, tente o nome da sala de outra maneira.

# MyBad11
source: I am sorry. I can't understand what you are saying. :(
es: Lo lamento. No comprendo lo que dices.
pt: Lamento. Eu não entendo o que você diz. :(

# MyBad12
source: We shouldn't be afraid to say "I don't know": I don't know.
es: No hay que tener miedo de decir "no sé": No sé.
pt: Não tenha medo de dizer "não sei" Eu não sei.

# MyBad13
source: I am not sure I understood. Could you try it again in other words?
es: No sé si comprendo. ¿Puedes probar con otras palabras?
pt: Eu não sei se eu entendi. Você pode tentar com palavras diferentes?

# MyBad2
source: I obviously don't have a good day today. What are you trying to tell me?
es: Se ve que no tengo un buen día, ¿qué me intentas decir?
pt: Eu não tive um bom dia, o que você está tentando me dizer?

# MyBad4
source: The road to wisdom is paved with good questions. And this is one. However, I don't have the answer for it. It is actually a hole in the road. Try again with a different wording.
es: El camino a la sabiduría está empedrado de buenas preguntas. Esta es una de ellas, pero no tengo la respuesta. Es un pozo en ese camino. Prueba con otras palabras.
pt: O caminho para a sabedoria é pavimentada com boas perguntas. Esta é um delas, mas eu não tenho a resposta. É um poço no caminho. Tente palavras diferentes.

# MyBad6
source: I admit my defeat, human. You'd better ask at the secretary's office on the first floor. :)
es: Acepto mi derrota, humano. Mejor pregunta en secretaría en el primer piso. :)
pt: Eu aceito a minha derrota, humano. Melhor perguntar na secretaria no primeiro andar. :)

# NoLocation
source: I can't undrstand what you are looking for. Please try again.
es: No entendí qué estás buscando. Prueba de otra forma por favor.
pt: Eu não entendi que sala você está procurando. Por favor, tente de outra maneira.

# NoMoreBreaks
source: No more breaks for today :(
es: Hoy no hay mas cortes :(
pt: Hoje não tem mais cortes :(

# NoSpeaker
source: I did not understand the name of the speaker. Could you write it in a different way?
es: No entendí esas palabras. ¿Puedes escribirlo de otra manera?
pt: Eu não entendi o nome do palestrante. Pode escrever isso de forma diferente?

# NoSpeakerSessions
source: Sorry, but I found no sessions where {0} is the speaker.
es: Lo siento. No encontré conferencias de {0}. ¿Algún sinónimo que se te ocurra?
pt: Sinto muito. Eu não encontrei palestras com {0} como palestrante.

# NoSpeakersFound1
source: Sorry, but there are no speakers called {0}
es: Lo siento, ningún orador responde al nombre de '{0}'
pt: Desculpe, nenhum palestrante responde com o nome de '{0}'.

# NoSpeakersFound2
source: I am not finding any speaker with that name. Would you like to try it in a different way?
es: No estoy encontrando ningún orador que se llame así. ¿Te animas a probar de otra forma?
pt: Eu não estou encontrando nenhum palestrante com esse nome. Teria como testar de outra forma?

# NoSpeakersFound3
source: I did not find that speaker... Could the speaker be registered under a different name?
es: Ese orador no lo he encontrado... ¿Estará registrado con otro nombre?
pt: Esse palestrante não é encontrado... Estará registrado com outro nome?

# RoomMap
source: You will find room {room} on the {0} floor.
es: La sala {0} la puede ubicar en el piso {1}.
pt: A sala {0} você pode encontrar no piso {1}.

# SearchFound
source: I don't get what you mean, but a search returned {0} sessions.
es: Enocntré {0} conferencias buscando por {1}.
pt: Não entendi o que quis me dizer, mas uma busca me devolveu {0} palestras.

# SessionCompany
source: for the company {0}
es: para la empresa {0}
pt: para a empresa {0}

# SessionSpeaker
source: for the speaker {0}
es: para el orador {0}
pt: para o orador {0}

# SessionTrack
source: for the track {0}
es: en el track {0}
pt: para esta faixa {0}

# Snack
source: The next break is at {0}. Then you will be able to enjoy {1} (among other things)
es: El próximo corte es las {0}. Ahí podrás disfrutar de {1} (entre otras cosas)
pt: O próximo intervalo é as {0}. Aí poderás desfrutar de {1} (entre outras coisas)

# SpeakerSessionFound
source: I found {0} sessions
es: Encontré {0} conferencias
pt: Encontre {0} palestras

# SpeakerSessionFound1
source: I found 1 session
es: Encontré 1 conferencia
pt: Encontre 1 palestra

# WhatFloor
source: What floor are you on right now?
es: ¿En qué piso te encuentras?
pt: Em que andar você se encontra?

# YourWelcome1
source: A pleasure!
es: Un placer!
pt: Um prazer!

# YourWelcome2
source: Glad to be of help. If you have any more questions, I am right here!
es: Fue un placer ayudar. Si tienes más preguntas, ¡aquí estoy!
pt: Foi um prazer ajudar. Se tiver mais perguntas, eu estou aqui!

# YourWelcome3
source: The path followed is the reward.
es: El camino es la recompensa.
pt: A viagem é a recompensa.
